app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "cnK-2uEOkL2V4JTq-iJmBA"], ["updated_at", "2020-10-13 00:45:58.044759"], ["id", 3]]
---
      def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save